self_introduction = "您好，我是陳柏衡(Chen PoHeng)🙋‍♂️，英文名字是Kevin ，目前就讀🏫臺灣大學資訊工程學系三年級。\n\n\
我從小就對💻資訊、電腦相當感興趣，進入大學後開始正式接觸程式。\n\n\
我對資訊科學領域中的各方面都相當感興趣🙆‍♂️， 凡舉各方面的應用，像是機器學習、網頁前後端、影像與音訊處理、資訊安全、資料探勘等，各方面的課程都有所接觸。\n目前主要在機器學習/深度學習方面有最多了解與研究❗️"

skill_1 = "在大學三年中，接觸過了相當多領域，目前最感興趣😻且也投入了最多時間的是👉「機器學習/深度學習」👈的部分。\n\n\
機器學習的基礎理論📙、模型訓練🔧到實際的應用，都有在課程的作業及project中有所接觸。👌👌👌\n\n\
無論是從最基本的📉regression, 簡單的NN, 常見的🖼CNN, RNN，到比較新的技術，例如用在🗣NLP的bert, 或用RL做簡單的遊戲ai🎮等，皆有接觸以及實作的經驗。"

skill_2 = "希望未來能夠講所學的知識與技術，運用在實際的情境中🏙，畢竟機器學習的最終目標，並不只是有好的performance，而是能夠使人使用之後，能夠獲得幫助、便利等🙆‍♂️🙆‍♀️，期許自己之後無論是研究或是工作都能繼續往這方面前進。↗️↗️↗️"

character_1 = "我認為自己是一個樂觀進取的人😄，並且擅長與人合作、共同為同個目標努力🤝🤝🤝，能夠在團隊中提出意見，並且在各方面提供協助。\n\n\
在團隊的合作與互動中，能夠快速的互相學習、進步💪💪，在討論的過程中也能夠綜合更多面向的想法💡💡💡，讓成品能夠更趨完美💯，我想這也是我喜愛團體合作的原因❗️"

character_2 = "過去也常常跟同學一同組隊，參與不同的程式應用競賽🏟，像在今年年初就參加了微軟與台積電共同辦的CareerHack👨‍💻，目前跟朋友們也正在參加玉山銀行辦的中文手寫字辨識比賽✍️。"

greet = "您好，我是陳柏衡(Chen PoHeng)🙋‍♂️，很高興認識你！\n\n\
您可以透過提問來更瞭解我喔！(ex. 詢問我的專長、個性、或叫我做個簡單的自我介紹)"

manual = "1. 點選下方選單，可以參訪\n👉(1) 我的Github\n👉(2) 我的學經歷\n👉(3) 我的Projects\n👉(4) 功能及設計簡介\n\n\
2. 透過Microsoft Azure LUIS(language understanding)服務，您可以自由的以任何中文文字詢問我問題，但目前功能尚未開發完全，因此暫時是根據問題與以下三者的相關性給予特定回答\n\
👉(1) 請我做自我介紹\n👉(2) 我的專長、有興趣的領域\n👉(3) 我的個性、特質\n\n\
更多相關資訊，請參考：github.com/b07902114/self-promotion-chatbot"